chapter13/sloshingTank3D/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh   solidBodyMotionFvMesh;

solidBodyMotionFvMeshCoeffs
{
    /*solidBodyMotionFunction SDA;*/
    /*SDACoeffs*/
    /*{*/
        /*CofG            ( 0 0 0 );*/
        /*lamda           50;*/
        /*rollAmax        0.22654;*/
        /*rollAmin        0.10472;*/
        /*heaveA          3.79;*/
        /*swayA           2.34;*/
        /*Q               2;*/
        /*Tp              13.93;*/
        /*Tpn             11.93;*/
        /*dTi             0.059;*/
        /*dTp             -0.001;*/
    /*}*/

    solidBodyMotionFunction linearMotion;

    linearMotionCoeffs
    {
        velocity (0 0 -1);
    }
}


// ************************************************************************* //
