chapter13/sloshingTank3D/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     interDyMFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         3;

deltaT          0.05;

writeControl    adjustableRunTime;

writeInterval   0.05;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression compressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.5;
maxAlphaCo      0.5;
maxDeltaT       1;

/*functions*/
/*{*/
    /*probes*/
    /*{*/
        /*type            probes;*/
        /*functionObjectLibs ("libsampling.so");*/
        /*outputControl   timeStep;*/
        /*outputInterval  1;*/
        /*probeLocations*/
        /*(*/
            /*( 0 9.95 19.77 )*/
            /*( 0 -9.95 19.77 )*/
        /*);*/
        /*fields*/
        /*(*/
            /*p*/
        /*);*/
    /*}*/
/*}*/


// ************************************************************************* //
